{
  "basics": {
    "name": "PEENAK INAMDAR",
    "email": "hello@bluequack.com",
    "linkedin": "https://www.linkedin.com/in/peenakinamdar/",
    "summary": "I'm seeking a Head of Engineering or Engineering Director position. My passion is to enhance team performance, deliver quality, and ensure system scalability through effective engineering practices, optimized developer experience, and evolving agile methodologies."
  },
  "skills": {
    "areas": [
      "Technical leadership and strategy",
      "Platform architecture & scalability",
      "Full-stack development (Python, Java, JavaScript, Docker, AWS, Google Cloud)",
      "Developer experience",
      "Team building & mentorship",
      "Agile & iterative workflows",
      "Cross-functional leadership",
      "Startup environments",
      "Product management"
    ]
  },
  "experience": [
    {
      "title": "Director of Engineering, Platform",
      "company": "Renaissance Learning",
      "location": "Wisconsin Rapids, WI (Remote)",
      "period": "October 2022 – May 2025",
      "website": "renaissance.com",
      "responsibilities": [
        "Directed the technical strategy, team structure, and staffing to execute a consolidation strategy by modernizing a legacy identity platform (.Net 4 and MS Services) to use modern tools and processes (Python, Golang, Postgres, Terraform, Docker, AWS: ECS, RDS, Lambda)",
        "Managed 10 engineers focused on user identity, authentication, and authorization. Promoted several of them to more senior IC roles and management",
        "Represented my teams to internal and external stakeholders, including product, security, and operations leadership, and supported ongoing SoC 2 Type 2, FERPA/CCPA, compliance, and security audits"
      ],
      "achievements": [
        "Revamped the iterative product development practices to focus more on a user-centric approach, prioritizing system stability and developer experience (with observability and monitoring), and expanding the team's performance monitoring and testing capabilities (DataDog, K6, Redline, JS)",
        "Directed and mentored the team in scaling the identity platform to handle over 30K logins per minute from ~10K per minute (Ory Hydra, Golang, Postgres, Redline, K6)",
        "Directed the development of a data ELT batch process to consolidate and match student and staff account entities across six products of over 24K, improving login experience (Python, dbt, PostgreSQL, Snowflake)",
        "Partnered with our client onboarding team and the AI/data sciences team to help them reduce user data matching effort by 90%, reducing a year of work to a few hours (dbt, Postgres, Retool)"
      ]
    },
    {
      "title": "Head of Engineering",
      "company": "The Muse",
      "location": "New York, NY (hybrid)",
      "period": "October 2018 – July 2022",
      "website": "themuse.com",
      "responsibilities": [
        "Led the technical strategy, team structure, and agile processes to execute product strategy for an employer branding site and job board",
        "Managed an engineering team of 16 engineers and managers, with five direct reports, and promoted over half of the team during my tenure"
      ],
      "achievements": [
        "Directed the re-architecture of the .com site to single-page applications (using Next.js and Node.js) powered by RESTful APIs (Python/FastAPI and CraftCMS for content management), reducing monthly AWS spend from $20k to $12k",
        "Realigned application engineering to be focused on growth, job marketplace mechanics, client tooling, and platform/ ML & Data Analytics",
        "Growing site readership to 7 million monthly unique visitors, up from 5 million",
        "90% growth in job applications by improving the site SEO and user conversion rates",
        "Launching a new client onboarding tool and portal for clients, reducing client onboarding time by 60%, and achieving the client retention objective of over 90%"
      ]
    },
    {
      "title": "Associate Director, Technology Management",
      "company": "Ogilvy, Inc.",
      "location": "New York, NY",
      "period": "August 2017 – Oct 2018",
      "responsibilities": [
        "Led technology teams on client projects, working closely with creative leads and campaign producers to ensure that projects were successfully delivered. Clients included: IBM, Lupus Foundation, FEMA, and USAID",
        "Directed 2-4 concurrent projects with teams of 2-5 technologists"
      ]
    },
    {
      "title": "Director of Engineering",
      "company": "Huge, Inc.",
      "location": "Brooklyn, NY",
      "period": "August 2011 – January 2017",
      "website": "hugeinc.com",
      "responsibilities": [
        "Directed technology teams on client engagements by working closely with other leads to ensure that projects were successfully integrated with clients and on time",
        "Achievements included developing an approach for agile processes on client projects, a new engineer skills matrix, managing a new technologies lab, and creating a software architecture training course",
        "Managed and mentored 20+ engineers across several disciplines, including client-side development (web and mobile), server-side development, DevOps, and quality assurance roles",
        "Promoted over 10 members of the team during my tenure"
      ],
      "achievements": [
        "Developing and implementing a new promotion ladder with accompanying skills matrix used for ongoing career development and goal setting",
        "Initiating, growing, and actively managing a makerspace and new technologies lab",
        "Developing and delivering a cross-office software architecture training course targeted at senior engineers"
      ]
    }
  ],
  "education": {
    "degree": "B.S. Computer Science",
    "institution": "University of Rochester",
    "graduationDate": "May 2000",
    "honors": ["with honors", "Dean's List"],
    "concentrations": ["Systems", "AI"],
    "additionalCoursework": ["Economics", "Studio Arts (photography)"]
  },
  "volunteering": [
    {
      "organization": "PS 397 Spruce Street PTA",
      "role": "Webmaster",
      "location": "New York, NY",
      "period": "Fall 2024 - Current"
    },
    {
      "organization": "The Meliora Collective Mentorship Program",
      "role": "Mentor",
      "location": "University of Rochester",
      "period": "Fall 2023 - Current"
    },
    {
      "organization": "iMentor",
      "role": "Mentor",
      "location": "New York, NY",
      "period": "August 2014 - Spring 2018"
    }
  ],
  "additionalAccomplishments": [
    {
      "title": "Executive Leadership Program",
      "organization": "McKinsey",
      "location": "Remote",
      "date": "Summer 2024"
    },
    {
      "title": "Introduction to Programming Robots with Huge",
      "organization": "Creative Mornings",
      "location": "New York, NY",
      "date": "October 16, 2015"
    }
  ]
} 